start_message = "🍕 غذا می‌قولی؟!"

main_menu_message = "از منویی که این پایین هست انتخاب کن که چی می‌خوای"
forget_code_menu_message = "ازین پایین چیزی که می‌خوای رو پیدا کن" # TODO
reserve_menu_messsage = "منوی رزرو" # TODO

details_message = """
توضیحات مربوط به انتخاب اولویت‌ها:
"""

# help_message = """
# /set <student_number> <password> :‌ تنظیم شماره‌ی دانشجویی و رمز عبور داینینگ
# /help: مشاهده‌ی راهنما
# """

help_message = """
هر جا گیر کردی /start بزن بیای منوی اول"""

admin_help_message = """
دستورات کاربران:
{}

دستورات ادمین (این بخش به کاربران عادی نمایش داده نمی‌شود)
/update_foods: به‌روزرسانی غذاها
""".format(help_message)

set_wrong_args_message = """اشتباه زدی. بعد از /set دو تا مقدار باید بذاری، اولی شماره‌دانشجویی، دومی رمز عبور.

این شکلی:
/set 97102111 thisismypassword1234"""

set_result_message = """
✅ اطلاعاتی که بهم دادی: 

👤 شماره دانشجویی: {}
🔑 رمز عبور: {}

اگه اشتباه زدی، دوباره بزن.
"""

update_food_list_result = """
🍟 {} غذای جدید پیدا شد!
"""

next_page_button_message = "< صفحه‌ی بعد"
previous_page_button_message = "صفحه‌ی قبل >"
done_button_message = "حله"
cancel_button_message = "لغو"

choose_food_priorities_message = """
به ترتیب علاقت، روی غذایی که می‌خوای کلیک کن. می‌تونی تو صفحه‌ی های دیگه هم دنبال غذاها بگردی 🍟
هر وقت انتخابت تموم شد، روی «حله» کلیک کن تا لیست غذاهات ثبت بشه و هر وقت منصرف شدی، روی «لغو» کلیک کن تا تغییراتت کنسل بشن 🍗
"""
choosing_food_priorities_done_message = """
غذاهای مورد علاقت به ترتیبی که گفتی (تو پیامای این زیر این پیام هم می‌تونی ببینیشون) انتخاب شد. 🍻
اگه دوباره /my_foods رو بزنی، می‌تونی از اول اولویت غذاهات رو مشخص کنی.
"""
choosing_food_priorities_cancel_message = """
لغو شد.
"""

choose_food_court_message_to_get = "کدوم سلف می‌خوای غذا بخوری؟"
choose_food_court_message_to_give = """دمت خیلی گرمه :))
کد فراموشیت برای کدوم سلفه؟"""

get_forget_code_from_user_message = "حالا لطفا کد فراموشیت رو برام بفرست"

not_int_code_error_message = "این چیه دیگه؟ کد بده بهم، کد فراموشی کلش باید عدد باشه"
not_enough_number_error_message = """کد فراموشی زمان ما ۷ رقمی بود، الان عوض شده؟ :))
یه چک بکن ببین کجاشو اشتباه زدی، دوباره بفرست"""
food_court_not_choosed_error_message = "سلف رو هنوز انتخاب نکردی که، انتخاب کن"
forget_code_added_message = "دمت گرم. خدا خیرت بده :)"
get_food_name_message = "عیول، فقط بی‌زحمت بگو غذاش چیه؟ اگه نمی‌دونی هم بگو نمی‌دونم :)"

no_code_for_this_food_court_message = "متاسفم، ولی کسی کد فراموشی واسه این سلف نذاشته :("
forget_code_founded_message = """یه کد برات پیدا کردم! :)
برو بزن به بدن، عشق کن. اینم کد:
{} - {} - {}

🍽 دم @{} هم گرم که این کد رو گذاشته
اگه خواستی ازش تشکر کن، منم براش یه پیام فرستادم و تشکر کردم :)
"""
code_statistics_message = """
کد مد چه خبر؟

کل کدهای امروز:
{}

کدهای قابل دریافت:
{}
"""
no_code_for_today_message = """
امروز هیچی کد ثبت نشده🥲
ایناس که بده!"""
no_available_code_for_today_message = """فعلا کدی که گرفته نشده باشه ندارم🥲"""
someone_took_your_code_message = "غرض از مزاحمت، یه نفر کدت رو گرفت! ممنون که کدت رو گذاشتی تو بات."

still_under_struction = """
⚠️کارگران مشغول کارند!⚠️

این بخش هنوز در دست توسعه‌ست و به بهره‌برداری نرسیده.
قراره که تو این بخش، یه سری امکان مثه رزرو غذای هفته به طور «اتوماتیک» و بدون دخالت دست اضافه بشه.
به زودی از این بخش بات هم رونمایی می‌‌کنیم :)"""

new_user_message = """
@{} اومد تو
"""

users_ranking_message = """
۵۰ نفری که بیشتر از بقیه کد فراموشی اهدا کردن:

{}

رتبه‌بندی هر چند دقیقه آپدیت می‌شه""" 

ranking_message = "🍔 {}- {}: {}\n" 
user_rank_message = "\nرتبه‌ی تو: {} از {} نفر"

no_one_added_code_yet_message = """
متاسفانه هنوز کسی کدی اضافه نکرده 🥲
ایناس که بده!

رتبه‌بندی هر چند دقیقه آپدیت می‌شه""" 

i_dont_want_this_code_message = """
این کد رو نمی‌خوام
"""
forget_taked_back_message = """
ممنون، کد تحویل گرفته شد"""
rank_not_found_message = """نمی‌دونم 🥶"""

restart_bot_message = "بات تو این مدتی که بهش سر نزدی یه بار ری‌استارت شده. لطفا یه /start بزن تا برات آپدیت بشه!"
fake_forget_code_report_message = "عه کد چرت دادن بهت؟ :( لطفا بگو که کدش چی بوده تا پیگیری کنم"
fake_forget_code_taked_message = "حله. ممنونم که اطلاع دادی و متاسفم بابت این اتفاق"
# fake_forget_code_taked_message = """
# حله. ممنونم که اطلاع دادی و متاسفم بابت این اتفاق
# این کد رو {} ثبت کرده بود. احتمالا یه اشتباه جزئی کرده تو وارد کردن کد."""

you_already_have_forget_code_message = "ببین یه دونه کد دیگه امروز گرفتی، اگه اونو نمی‌خوای، دکمه‌ی زیرش رو بزن، بعد واسه کد جدید درخواست بده."

update_foods_started_message = "🔍 آپدیت لیست غذاها آغاز شد"
no_food_found_message = "هیچ غذایی تو جدول رزرو پیدا نکردم 🤔"

choose_food_courts_to_automatic_reserve_message = "از بین سلف‌های پایین، سلف‌هایی که می‌خوای براشون اتوماتیک غذا رزرو بشه رو انتخاب کن"
no_user_info_message = "هنوز شماره دانشجویی و رمز عبورت رو بهم ندادی. از منوی رزرو، بخش تنظیم مشخصات، این اطلاعاتو بهم بده تا بتونم برات غذا رزرو کنم"
activate_automatic_reserve_started_message = "هممم، چند لحظه صبر کن"
choosing_food_courts_done_message = "حله. از این به بعد، هر هفته غذا برای سلف‌هایی که انتخاب کردی، بر اساس اولویت‌های که بهم گفتی رزرو می‌شه"
choosing_food_courts_cancel_message = "لغو شد"

get_username_message = "لطفا شماره دانشجوییت رو بهم بگو"
get_password_message = "لطفا رمز عبورت رو هم بهم بگو"
username_and_password_saved_message = "رواله. بذار یه چک بکنم ببینم اطلاعاتی که دادی درسته یا نه. الان خبرت می‌کنم."
username_or_password_incorrect_message = "با این مشخصاتی که دادی نتونستم وارد سایت بشم. یه چک بکن چیزایی که وارد کردی رو و دوباره روی گزینه‌ی تنظیم مشخصات کلیک کن."
username_and_password_correct_message = "اطلاعاتت درست بود و تونستم وارد سایت بشم"

reserve_was_secceeded_message = "غذای هفته‌ی بعدت توی «{}» رزرو شد. یه چک بکن همه چی درست باشه. اگه مشکلی بود بهم بگو"
reserve_was_failed_message = "یه مشکلی توی رزرو غذای هفته‌ی بعدت توی «{}» به وجود اومد. لطفا یه سر به سایت داینینگ بزن و چک کن غذایی رزرو نشده باشه، یا این که به اندازه‌ی کافی موجودی داشته باشی."