PLACES = {
    "مرکزی - سلف دانشجویان آقا": "19",
    "خوابگاه - طرشت 3": "21",
    "خوابگاه - شهید احمدی روشن": "22",
    # "خوابگاه - مصلی نژاد": "24",
    # "خوابگاه - شهید وزوایی": "25",
    # "خوابگاه - شادمان": "26",
    # "خوابگاه - آزادی": "28",
    # "خوابگاه - 12واحدی": "29",
    # "خوابگاه - ولیعصر": "30",
    # "خوابگاه - درویشوند": "55",
    # "رستوران های مکمل - سلف آزاد - دنا": "58",
    # "رستوران های مکمل - سلف آزاد - لاله": "59"
}

# Stages
MAIN_MENU_CHOOSING, FORGET_CODE_MENU_CHOOSING, RESERVE_MENU_CHOOSING, CHOOSING_SELF_TO_GET, CHOOSING_SELF_TO_GIVE, INPUT_FORGET_CODE = range(6)

MAIN_MENU_CHOICES = [
    ['Code', 'Reserve']
]
FORGET_CODE_MENU_CHOICES = [
    ['Get', 'Give'],
    ['Main']
]
RESERVE_MENU_CHOICES = [
    ['Reserve', 'Set Favorites'],
    ['Main']
]

SELFS = [
    ['سلف پسرها', 'سلف دخترها'],
    ['احمدی روشن', 'طرشت ۲', 'طرشت ۳'],
    ['مصلی نژاد', 'آزادی', 'شهید شوریده'],
    ['شهید وزوایی', 'شهید حیدرتاش', 'شهید صادقی'],
    ['شادمان', 'ولیعصر', 'شهرک'],
    ['درویش‌وند'],
    ['Main']
]